unique-identifier/freebsd-src/share/man/man5/make.conf.5
.\" Copyright (c) 2000
.\"	Mike W. Meyer
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.Dd September 13, 2026
.Dt MAKE.CONF 5
.Os
.Sh NAME
.Nm make.conf
.Nd system build information
.Sh DESCRIPTION
The file
.Nm
contains system-wide settings that will apply to every build using
.Xr make 1
and the standard
.Pa sys.mk
file.
This is achieved as follows:
.Xr make 1
processes the system makefile
.Pa sys.mk
before any other file by default, and
.Pa sys.mk
includes
.Nm .
.Pp
The file
.Nm
uses the standard makefile syntax.
However,
.Nm
should not specify any dependencies to
.Xr make 1 .
Instead,
.Nm
is to set
.Xr make 1
variables that control the actions of other makefiles.
.Pp
The default location of
.Nm
is
.Pa /etc/make.conf ,
though an alternative location can be specified in the
.Xr make 1
variable
.Va __MAKE_CONF .
You may need to override the location of
.Nm
if the system-wide settings are not suitable for a particular build.
For instance, setting
.Va __MAKE_CONF
to
.Pa /dev/null
effectively resets all build controls to their defaults.
.Pp
The primary purpose of
.Nm
is to control the compilation of the
.Fx
sources, documentation, and ported applications,
which are usually found in
.Pa /usr/src ,
.Pa /usr/doc ,
and
.Pa /usr/ports .
As a rule, the system administrator creates
.Nm
when the values of certain control variables need to be changed
from their defaults.
.Pp
The system build procedures occur in four broad areas:
the world, the kernel, documentation and ports.
Variables set in
.Nm
may be applicable in one, two, or all four of these areas.
In addition, control variables can be specified
for a particular build via the
.Fl D
option of
.Xr make 1
or in
.Xr environ 7 .
In the case of world and kernel builds it is possible to put these variables
into
.Xr src.conf 5
instead of
.Nm .
This way the environment for documentation and ports builds is not polluted
by unrelated variables.
.Pp
The following lists provide a name and short description for each
variable you can use during the indicated builds.
The values of
variables flagged as
.Vt bool
are ignored; the variable being
set at all (even to
.Dq Li FALSE
or
.Dq Li NO )
causes it to
be treated as if it were set.
.Pp
The following list provides a name and short description for variables
that are used for all builds, or are used by the
.Pa makefiles
for things other than builds.
.Bl -tag -width Ar
.It Va ALWAYS_CHECK_MAKE
.Pq Vt bool
Instructs the top-level makefile in the source tree (normally
.Pa /usr/src )
to always check if
.Xr make 1
is up-to-date.
Normally this is only done for the world and buildworld targets to handle
upgrades from older versions of
.Fx .
.It Va CFLAGS
.Pq Vt str
Controls the compiler setting when compiling C code.
Optimization levels other than
.Fl O
and
.Fl O2
are not supported.
.It Va CPUTYPE
.Pq Vt str
Controls which processor should be targeted for generated
code.
This controls processor-specific optimizations in
certain code (currently only OpenSSL) as well as modifying
the value of
.Va CFLAGS
and
.Va COPTFLAGS
to contain the appropriate optimization directive to
.Xr cc 1 .
To set the
.Va CPUTYPE
value, use
.Dq Li ?=
instead of
.Dq Li =
so that it can be overridden by
.Xr make 1
targets.
The automatic setting of
.Va CFLAGS
may be overridden using the
.Va NO_CPU_CFLAGS
variable.
Refer to
.Pa /usr/share/examples/etc/make.conf
for a list of recognized
.Va CPUTYPE
options.
.It Va CXXFLAGS
.Pq Vt str
Controls the compiler settings when compiling C++ code.
.Va CXXFLAGS
is initially set to the value of
.Va CFLAGS .
If you want to
add to the
.Va CXXFLAGS
value, use
.Dq Li +=
instead of
.Dq Li = .
.It Va DTC
.Pq Vt str
Select the compiler for DTS (Device Tree Syntax) file.
.Va DTC
is initially set to the value of dtc
.It Va INSTALL
.Pq Vt str
the default install command.
To install only files for which the target differs or does not exist, use
.Bd -literal -offset indent
INSTALL+= -C
.Ed
Note that some makefiles (including those in
.Pa /usr/share/mk )
may hardcode options for the supplied install command.
.It Va LOCAL_DIRS
.Pq Vt str
List any directories that should be entered when doing
make's in
.Pa /usr/src
in this variable.
.It Va MAKE_SHELL
.Pq Vt str
Controls the shell used internally by
.Xr make 1
to process the command scripts in makefiles.
.Xr sh 1 ,
.Xr ksh 1 ,
and
.Xr csh 1
all currently supported.
.Pp
.Dl "MAKE_SHELL?=sh"
.It Va MTREE_FOLLOWS_SYMLINKS
.Pq Vt str
Set this to
.Dq Fl L
to cause
.Xr mtree 8
to follow symlinks.
.It Va NO_CPU_CFLAGS
.Pq Vt str
Setting this variable will prevent CPU specific compiler flags
from being automatically added to
.Va CFLAGS
during compile time.
.El
.Ss "BUILDING THE KERNEL"
The following list provides a name and short description for variables
that are only used doing a kernel build:
.Bl -tag -width Ar
.It Va BOOTWAIT
.Pq Vt int
Controls the amount of time the kernel waits for a console keypress
before booting the default kernel.
The value is approximately milliseconds.
Keypresses are accepted by the BIOS before booting from disk,
making it possible to give custom boot parameters even when this is
set to 0.
.It Va COPTFLAGS
.Pq Vt str
Controls the compiler settings when building the
kernel.
Optimization levels above
.Oo Fl O ( O2 , No ...\& ) Oc
are not guaranteed to work.
.It Va KERNCONF
.Pq Vt str
Controls which kernel configurations will be
built by
.Dq Li "${MAKE} buildkernel"
and installed by
.Dq Li "${MAKE} installkernel" .
For example,
.Bd -literal -offset indent
KERNCONF=MINE DEBUG GENERIC OTHERMACHINE
.Ed
.Pp
will build the kernels specified by the config files
.Pa MINE , DEBUG , GENERIC ,
and
.Pa OTHERMACHINE ,
and install the kernel specified by the config file
.Pa MINE .
It defaults to
.Pa GENERIC .
.It Va MODULES_OVERRIDE
.Pq Vt str
Set to a list of modules to build instead of all of them.
.It Va NO_KERNELCLEAN
.Pq Vt bool
Set this to skip running
.Dq Li "${MAKE} clean"
during
.Dq Li "${MAKE} buildkernel" .
.It Va NO_KERNELCONFIG
.Pq Vt bool
Set this to skip running
.Xr config 8
during
.Dq Li "${MAKE} buildkernel" .
.It Va NO_KERNELOBJ
.Pq Vt bool
Set this to skip running
.Dq Li "${MAKE} obj"
during
.Dq Li "${MAKE} buildkernel" .
.It Va NO_MODULES
.Pq Vt bool
Set to not build modules with the kernel.
.It Va PORTS_MODULES
Set this to the list of ports you wish to rebuild every time the kernel
is built.
.It Va WITHOUT_MODULES
.Pq Vt str
Set to a list of modules to exclude from the build.
This provides a
somewhat easier way to exclude modules you are certain you will never
need than specifying
.Va MODULES_OVERRIDE .
This is applied
.Em after
.Va MODULES_OVERRIDE .
.El
.Ss "BUILDING THE WORLD"
The following list provides a name and short description for variables
that are used during the world build:
.Bl -tag -width Ar
.It Va BOOT_COMCONSOLE_PORT
.Pq Vt str
The port address to use for the console if the boot blocks have
been configured to use a serial console instead of the keyboard/video card.
.It Va BOOT_COMCONSOLE_SPEED
.Pq Vt int
The baud rate to use for the console if the boot blocks have
been configured to use a serial console instead of the keyboard/video card.
.It Va ENABLE_SUID_K5SU
.Pq Vt bool
Set this if you wish to use the ksu utility.
Otherwise, it will be
installed without the set-user-ID bit set.
.It Va ENABLE_SUID_NEWGRP
.Pq Vt bool
Set this to install
.Xr newgrp 1
with the set-user-ID bit set.
Otherwise,
.Xr newgrp 1
will not be able to change users' groups.
.It Va LOADER_FIREWIRE_SUPPORT
.Pq Vt bool
Defining this and recompiling
.Pa /usr/src/stand/i386
will add
.Xr dcons 4
console driver to
.Xr loader 8
and allow access over FireWire(IEEE1394) using
.Xr dconschat 8 .
Currently, only i386 and amd64 are supported.
.It Va MAN_ARCH
.Pq Vt str
Space-delimited list of one or more MACHINE and/or MACHINE_ARCH values
for which section 4 man pages will be installed.
The special value
.Sq all
installs all available architectures.
It is also the default value.
.It Va MODULES_WITH_WORLD
.Pq Vt bool
Set to build modules with the system instead of the kernel.
.It Va NO_CLEAN
.Pq Vt bool
Set this to disable cleaning during
.Dq Li "make buildworld" .
This should not be set unless you know what you are doing.
.It Va NO_CLEANDIR
.Pq Vt bool
Set this to run
.Dq Li "${MAKE} clean"
instead of
.Dq Li "${MAKE} cleandir" .
.It Va WITH_MANCOMPRESS
.Pq Vt defined
Set to install manual pages compressed.
.It Va WITHOUT_MANCOMPRESS
.Pq Vt defined
Set to install manual pages uncompressed.
.It Va NO_SHARE
.Pq Vt bool
Set to not build in the
.Pa share
subdir.
.It Va NO_SHARED
.Pq Vt bool
Set to build
.Pa /bin
and
.Pa /sbin
statically linked, this can be bad.
If set, every utility that uses
.Pa bsd.prog.mk
will be linked statically.
.It Va PKG_REPO_SIGNING_KEY
.Pq Vt str
Path to rsa private key passed to
.Xr pkg-repo 8
to sign packages created when building the
.Ar packages
target, i.e.: pkgbase.
The variable is named the same in
.Xr poudriere 8
so it will automatically be picked up when building pkgbase with poudriere.
.It Va TOP_TABLE_SIZE
.Pq Vt int
.Xr top 1
uses a hash table for the user names.
The size of this hash can be tuned to match the number of local users.
The table size should be a prime number
approximately twice as large as the number of lines in
.Pa /etc/passwd .
The default number is 20011.
.It Va WANT_FORCE_OPTIMIZATION_DOWNGRADE
.Pq Vt int
Causes the system compiler to be built such that it forces high optimization
levels to a lower one.
.Xr cc 1
.Fl O2
and above is known to trigger known optimizer bugs at various
times.
The value assigned is the highest optimization value used.
.El
.Ss "BUILDING DOCUMENTATION"
The following list provides a name and short description for variables
that are used when building documentation.
.Bl -tag -width ".Va PRINTERDEVICE"
.It Va DOC_LANG
.Pq Vt str
The list of languages to build and install when building documentation
in
.Pa /usr/doc .
.It Va PRINTERDEVICE
.Pq Vt str
The default format for system documentation in
.Pa /usr/src/share/doc ,
depends on your printer.
This can be set to
.Dq Li ascii
for simple printers, or
.Dq Li ps
for postscript or graphics printers with a ghostscript
filter, or both.
.El
.Ss "BUILDING PORTS"
Several make variables can be set that affect the building of ports.
These variables and their effects are documented in
.Xr ports 7 ,
.Pa ${PORTSDIR}/Mk/*
and the
.Fx
Porter's Handbook.
.Sh FILES
.Bl -tag -width ".Pa /usr/share/examples/etc/make.conf" -compact
.It Pa /etc/make.conf
.It Pa /usr/doc/Makefile
.It Pa /usr/ports/Makefile
.It Pa /usr/share/examples/etc/make.conf
.It Pa /usr/share/mk/sys.mk
.It Pa /usr/src/Makefile
.It Pa /usr/src/Makefile.inc1
.El
.Sh SEE ALSO
.Xr cc 1 ,
.Xr install 1 ,
.Xr make 1 ,
.Xr src.conf 5 ,
.Xr style.Makefile 5 ,
.Xr environ 7 ,
.Xr ports 7 ,
.Xr dma 8
.Sh HISTORY
The
.Nm
file appeared sometime before
.Fx 4.0 .
.Sh AUTHORS
This
manual page was written by
.An Mike W. Meyer Aq Mt mwm@mired.org .
.Sh CAVEATS
Note, that
.Ev MAKEOBJDIRPREFIX
and
.Ev MAKEOBJDIR
are environment variables and should not be set in
.Nm
or as command line arguments to
.Xr make 1 ,
but in make's environment.
.Sh BUGS
This manual page may occasionally be out of date with respect to
the options currently available for use in
.Nm .
Please check the
.Pa /usr/share/examples/etc/make.conf
file for the latest options which are available.
